{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "W_constraint": null, "nb_row": 5, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 24, "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_6", "nb_col": 5, "bias": true, "batch_input_shape": [null, 66, 200, 1], "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "W_constraint": null, "nb_row": 5, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 36, "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_7", "nb_col": 5, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "W_constraint": null, "nb_row": 5, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 48, "subsample": [2, 2], "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_8", "nb_col": 5, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_9", "nb_col": 3, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "subsample": [1, 1], "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_10", "nb_col": 3, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 100, "input_dim": 1152, "name": "dense_4", "batch_input_shape": [null, 1152], "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 50, "input_dim": 100, "name": "dense_5", "batch_input_shape": [null, 100], "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 10, "input_dim": 50, "name": "dense_6", "batch_input_shape": [null, 50], "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "trainable": true, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 1, "input_dim": 10, "name": "y_pred", "batch_input_shape": [null, 10], "input_dtype": "float32"}}]}